-- Script de carga inicial para horários de aula

INSERT INTO "ClassPeriods" ("Name", "Shift", "StartTime", "EndTime")
VALUES 
    ('1ª Aula', 1, '07:30:00', '08:15:00'),
    ('2ª Aula', 1, '08:15:00', '09:00:00'),
    ('3ª Aula', 1, '09:00:00', '09:45:00'),
    ('4ª Aula', 1, '10:00:00', '10:45:00'),
    ('5ª Aula', 1, '10:45:00', '11:30:00'),
    
    ('1ª Aula', 2, '13:30:00', '14:15:00'),
    ('2ª Aula', 2, '14:15:00', '15:00:00'),
    ('3ª Aula', 2, '15:00:00', '15:45:00'),
    ('4ª Aula', 2, '16:00:00', '16:45:00'),
    ('5ª Aula', 2, '16:45:00', '17:30:00');